---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSet.GetEnumerator
source: html/b6e6b7a4-86f6-3fd7-850b-564e0a60c535.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.GetEnumerator Method

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```